const express = require('express');
var app = express();

const updateOps = {}; // создаем пустой объект, который будем начинять параметрами, которые будем изменять в базе
for (const ops of req.body) { // создаем цикл в котором опс будем являться телом данных полученным ПАТЧ запросом
  updateOps[ops.propName] = ops.value; // создаем массив аргумент которого равен свойству объекта из базы, значение которого будем изменять, а валью собсвтенно это зачение, который мы задает клиент
}
console.log(updateOps);
